{
  "iowa": [
    { "src": "images/iowa/DSC03296.jpg", "caption": "On a walk with my dad. Talking about life and how we got to this moment. I landed in Iowa November 21, 2025 and it was about 70 degrees. Ha! Ha! My dad and I have taken walks together for as long as I can remember. I think I get my joy of walks from him actually." },
    { "src": "images/iowa/DSC03305.jpg", "caption": "It took me entirely too long to find this exact location. I wanted to show my dad this cool wooden path that felt like it was hovering over a secret pond. The road I usually drove down was blocked off and we came from another way but I was determined to show my dad and eventually found it. Sadly, the pond was gone and nothing was left but dead brush and it didn't look so magical anymore." },
    { "src": "images/iowa/DSC03310.jpg", "caption": "My dad and I managed to find a little pond on this same walk. Upside down or rightside up?" },
    { "src": "images/iowa/DSC03311.jpg", "caption": "Such a sucker for a good reflection. To my surprise, my dad had never visited these trails and was seeing all of this for the first time. Despite having spent the past 20+ years living in the Cedar Rapids area. I was pretty excited to share this with him." },
    { "src": "images/iowa/DSC03319.jpg", "caption": "Now it was my dads turn to show me something he thought was cool. \"Kris, you want to see a huge split rock?\" and with that, we were back in Marion, IA where I grew up." },
    { "src": "images/iowa/DSC03320.jpg", "caption": "The sunset was exploding before our very eyes and we both are drawn to the beauty of it. It's always a great feeling to share a passion with someone else, I would say taking photos of the sunset is one my dad and I have always shared." },
    { "src": "images/iowa/DSC03323.jpg", "caption": "If you were on the edge of your seat to see this giant spit rock that resides in Marion, IA here is your chance! Right off Hwy 13." },
    { "src": "images/iowa/IMG_0606.jpg", "caption": "My dad and I stopped for acai bowls on our way back home. It was a perfect ending to a perfect day." },
    { "src": "images/iowa/DSC03328.jpg", "caption": "Couple photoshoot for the win! We ate dinner at 'The Black Sheep' restaurant and went for martinis after at 'Bartini' a new hip spot in Cedar Rapids next to the river." },
    { "src": "images/iowa/DSC03329.jpg", "caption": "Love covers a multitude of sins - 1 Peter 4:8." },
    { "src": "images/iowa/DSC03341.jpg", "caption": "Now that's a wecolme sign! It's never goodbye, it's always see you later." },          
    { "src": "images/iowa/DSC00875.jpg", "caption": "It felt like love. I've never been so completely and utterly in love with someone. On this very street, my heart was captured." },
    { "src": "images/iowa/DSC00863.jpg", "caption": "Humbly, it wasn't returned. On this same street my heart broke." },
    { "src": "images/iowa/IMG_0720.jpg", "caption": "Snow covered backyard. My dad planted a natural privacy fence with beautiful trees and bushes that now carefully collect the unique snow flakes as precious decor in the winter." },
    { "src": "images/iowa/DSC02222.jpg", "caption": "'Mom, I know a spot' and takes me to the most beautiful willow along Ellis." },
    { "src": "images/iowa/DSC02283.jpg", "caption": "If you live in this area then you already know where this is. Palisades-Kepler State Park." },
    { "src": "images/iowa/DSC02302.jpg", "caption": "How does one cope with loss? I have always 'Went on a walk' and this has been my go to walk spot for many, many years. I am an overthinker, you can try to change it or just embrace the benefits to turning something over and over in your head until you've seen it all. Prairie Park Fishery." },
    { "src": "images/iowa/DSC02333.jpg", "caption": "What a crazy night to come into Cedar Rapids! A lightening storm that did not disappoint!" },
    { "src": "images/iowa/IMG_5347.jpg", "caption": "We all have our 'things' and for us, going on an adventure is a way to escape the mundane. Lake Macbride is a great way to escape the city and spend some quality time with those you love." },
    { "src": "images/iowa/IMG_5428.jpg", "caption": "Marion, IA : This trail has been a companion of mine since 1991. I walked this trail almost daily. It's seen me smiling from ear to ear and crying my heart out. Although, this used to be an open field, now sits what is more than likely Skogman homes." }
  ],

  "nature": [
    { "src": "images/nature/DSC01165.jpg", "caption": "Bryce Canyon National Park. On a RV trip with my aunt Barb. Many folks have asked, how many aunts do you have? I have 5 that are in my life. Truly a blessing." },
    { "src": "images/nature/DSC01167.jpg", "caption": "Had to pull over and hike this beautiful scenic trail." },
    { "src": "images/nature/DSC01575.jpg", "caption": "The West coast has to be the most beautiful coast of all. Seaside, CA and what a spectacular view the coast was! The salty air, the cool ocean breeze and the sound of the waves crashing against the rocks." },
    { "src": "images/nature/DSC01588.jpg", "caption": "I rented a motel room right in Seaside. Took a lot of drives along the coast and early in the morning the fog covered the view until I reached a place to hike around." },
    { "src": "images/nature/grand canyon 5.jpg", "caption": "Camped with my aunt in her RV at the Grand Canyon and spent the weekend exploring." },
    { "src": "images/nature/grand canyon 6.jpg", "caption": "Taking in for the first time ever, the Grand Canyon." },
    { "src": "images/nature/grand canyon 10.jpg", "caption": "Seeing is believing and now I see why so many folks have been in love with the Grand Canyon." },
    { "src": "images/nature/IMG_1183.jpg", "caption": "Returning my aunt Barb all the way back home in Saint Paul, MN. Go Vikings! " },
    { "src": "images/nature/sedona.jpg", "caption": "Sedona, AZ - The red rocks and the desert landscape are breathtaking." }
  ],

  "nevada": [
    { "src": "images/nevada/DSC01686.jpg", "caption": "Nevada like you have never seen it before! Truly, Lake Manly that supposedly forms every 10,000 years in Death Valley in the Bad Waters. (Date: 2/28/2023 Happy birthday to me)" },
    { "src": "images/nevada/DSC01691.jpg", "caption": "I could have stayed all day taking in this view. I can hardly believe that this moment is real but yet here we are 2023." },
    {"src": "images/nevada/IMG_2998.jpg", "caption": "Lake Manly: Death Valley, CA." },
    {"src": "images/nevada/IMG_3001.jpg", "caption": "Surfs up! "},
    { "src": "images/nevada/DSC03673.jpg", "caption": "A cowboy and a 10,0000 year old lake. The odds? I'm not sure but I know that this is the second appearance of this lake in two years. The lake is back like 2023 but nope, it's 2025!!! " },
    { "src": "images/nevada/DSC03675.jpg", "caption": "I too brought a kayak but saw that only a few inches of water wouldn't do the trick so opted to leave it in the car. This family however, brought the best photo propt. Appreciate the effort carrying this kayak all the way out here." },
    { "src": "images/nevada/DSC03677.jpg", "caption": "Reminded me of seeing a bunch of kids bikes all laid together in someone's yard like it was 1990 and kids still played outside." },
    { "src": "images/nevada/DSC03679.jpg", "caption": "Gotta go a few miles to get deep enough. Even then ya'll might still be walking on water." },
    { "src": "images/nevada/DSC03680.jpg", "caption": "My uncles girlfriend and her little dog too." },
    {"src": "images/nevada/IMG_0205.jpg", "caption": "Having a biblical moment." },
    {"src": "images/nevada/IMG_1372.jpg", "caption": "Look back at it - Lil Wayne"},
    {"src": "images/nevada/IMG_5865.jpg", "caption": "I think I can fly - R Kelly"},
    { "src": "images/nevada/DSC02661.jpg", "caption": "Still in Death Valley! The views are almost limitless." },
    { "src": "images/nevada/DSC02663.jpg", "caption": "The layers of mountains never get old." },
    { "src": "images/nevada/DSC02666.jpg", "caption": "BTW I had just had surgery and this was my mandatory walk of the day. Not a bad view!" },
    { "src": "images/nevada/DSC02668.jpg", "caption": "I am not sure if folks are supposed to be out there but I tend to mind my own damn business." },
    { "src": "images/nevada/DSC02672.jpg", "caption": "Who said the desert landscape was boring?!" },
    { "src": "images/nevada/DSC02943.jpg", "caption": "The seven Magic Mountains - art exhibit." },
    { "src": "images/nevada/DSC03151.jpg", "caption": "Another one of my favorite places to hike, Mt. Charleston. Coincidently, the first mountain I ever hiked on my 30th birthday. I traveled here to visit a friend - she had the opportunity to move in the Vegas area years before I did." },
    { "src": "images/nevada/DSC03232.jpg", "caption": "Ladder loop trail, Mt. Charleston. About a block up from this location my good friend from Iowa was married! " },
    { "src": "images/nevada/DSC03233.jpg", "caption": "Solo dolo - hiking. It's the best way to sort out thoughts." },
    { "src": "images/nevada/DSC03234.jpg", "caption": "Peace, quiet and a conversation with God." },
    { "src": "images/nevada/DSC03594-3.jpg", "caption": "8 minutes from home and I can hardly wait to pee but again, had to take this shot." },
    { "src": "images/nevada/DSC02795.jpg", "caption": "Cowboy Canyon facing Red Rock Canyon. Was hiking around with some friends and if I told you they brought a little weiner dog that was leading the way! " },
    { "src": "images/nevada/DSC02800.jpg", "caption": "The first friend that I met besides my realtor! Oriana and her husband Jason. Can you spot the little pup in her backpack?! " },
    { "src": "images/nevada/DSC02806.jpg", "caption": "If anyone is interested, they give horse back rides here at Cowboy Canyon." },
    { "src": "images/nevada/DSC02944.jpg", "caption": "Let's enter Red Rock Canyon because this was my 'backyard' for three years." },
    { "src": "images/nevada/DSC02947.jpg", "caption": "Taking this trail with the hope that I'll find the waterfall. Ps. I never found it but did come across a pretty grand creek." },
    { "src": "images/nevada/DSC02951.jpg", "caption": "The red stripes of the canyon walls." },
    { "src": "images/nevada/DSC02953.jpg", "caption": "Even in the desert, flowers grow." },
    { "src": "images/nevada/DSC02958.jpg", "caption": "Red Rock Canyon..." },
    { "src": "images/nevada/DSC02964.jpg", "caption": "...the views are endless." }
   
  ],

  "portraits": [
    { "src": "images/portraits/DSC01858.jpg", "caption": "Hello to the Renaas Family!" },
    { "src": "images/portraits/DSC01992.jpg", "caption": "Perhaps the last man to carry on the Renaas name and his beautiful babies." },
    { "src": "images/portraits/DSC02005.jpg", "caption": "Sethers - and his mini me and mini Kayla bug!" },
    { "src": "images/portraits/DSC02131.jpg", "caption": "Natural beauty. Inside and Out." },
    { "src": "images/portraits/DSC03363-2.jpg", "caption": "Doesn't matter if you're black or white - M.Jackson" },
    { "src": "images/portraits/DSC03378.jpg", "caption": "On repeat." },
    { "src": "images/portraits/DSC03432.jpg", "caption": "Merry Christmas you filthy animals!" },
    { "src": "images/portraits/DSC03441.jpg", "caption": "Snow white and the seven dwarfs." },
    { "src": "images/portraits/DSC03506.jpg", "caption": "Many winters ago, there was a guy on IG who said 'turn on your flash' so that's what I did." },
    { "src": "images/portraits/IMG_5100.jpg", "caption": "Covid is the worst...hindsight this was between Covid and the Derecho. Boy was our lives about to change." },
    { "src": "images/portraits/IMG_8969.jpg", "caption": "My big sis or Hercules?" }
  ],

  "travel": [
    { "src": "images/travel/IMG_7243.jpg", "caption": "Mayan Cave tubing in Belize" },
    { "src": "images/travel/IMG_7327.jpg", "caption": "Took a tour across Belize - solo dolo - the amount of women owned and ran farms was impressive!" },
    { "src": "images/travel/IMG_7348.jpg", "caption": "Youth behavior center in Belize where young boys play basketball" },
    { "src": "images/travel/IMG_7357.jpg", "caption": "Bought a coconut drink from this gentleman while driving across Belize." },
    { "src": "images/travel/laundry.jpg", "caption": "Hopkins, Belize this is the center of this little town." },
    { "src": "images/travel/pier 2.jpg", "caption": "Ran and jumped off this pier the moment I put my bags away when I first got to Belize." },
    { "src": "images/travel/stork nest.jpg", "caption": "A stork nest in the middle of a small town in Portugal. They liked to make their nests in electrical lines." },
    { "src": "images/travel/birds.jpg", "caption": "Three little birds- Bob Marley but in Portugal" },
    { "src": "images/travel/IMG_3103.jpg", "caption": "The most beautiful churches in the world exist here. Sintra,Portugal." },
    { "src": "images/travel/IMG_3106.jpg", "caption": "On a river boat in the heart of Porto, Portugal with my aunt Sheila, her husband uncle Tucker and her high school best friend Gary and his wife Darci. Long story short, I said 'Auntie, would you go to Portugal with me? I'm thinking of moving there one day?' To which she replied, 'My friends live there, lets go and stay with them!' What an absolutely amazing experience! " },
    { "src": "images/travel/IMG_3117.jpg", "caption": "I wish I knew the names of all these locations but I was just so captivated by the architecture and culture, I hardly took a moment to jot notes." },
    { "src": "images/travel/IMG_3142.jpg", "caption": "I know that this is a palace! Kings and Queens lived here and the bathrooms were next level with two toilets! Ha! Ha! I'm such an American." },
    { "src": "images/travel/IMG_3161.jpg", "caption": "This is a memorial for those who lost their lives." },
    { "src": "images/travel/IMG_3168.jpg", "caption": "City Hall of sorts?" },
    { "src": "images/travel/IMG_3184.jpg", "caption": "The public transporation in Europe is something to write home about. Between the buses, the cheap ubers, the horses and trains you really don't need a car." },
    { "src": "images/travel/IMG_3200.jpg", "caption": "Each evening we would walk to dinner. We stayed in four different cities during our travels throughout Portugal and the energy of the evening was so inviting. My favorite tradition was after dinner enjoying coffee and chatting." },
    { "src": "images/travel/IMG_3226.jpg", "caption": "We took a day to explore a few different castles and it was so much fun to see these first hand! Interesting how we have always had rich and poor - kind of like it was told we would in the bible. hmmm." },
    {"src": "images/travel/IMG_3234.jpg", "caption": "This castle was built on a hill and had the most amazing views of the surrounding area." },
    { "src": "images/travel/IMG_3241.jpg", "caption": "Exploring the downtown area of Sintra, Portugal. Live music from a guy, an amp and guitar coming from nearby." },
    { "src": "images/travel/IMG_3242.jpg", "caption": "Shopping in these cute stores on a little hill. How much I loved these little alley ways. I felt like I was shopping for a magical wand and maybe I caught the train to Hogwarts." },
    { "src": "images/travel/IMG_3292.jpg", "caption": "The amount of beautiful tile in Portugal is unreal." },
    { "src": "images/travel/IMG_3318.jpg", "caption": "Inside the palace that we stayed at. We toured the Queen and Kings chambers. This was a dance room." },
    { "src": "images/travel/IMG_3322.jpg", "caption": "Chairs for the Queen and King." },
    { "src": "images/travel/IMG_3360.jpg", "caption": "In Lisbon, Portugal we took the worlds tallest elevator." },
    { "src": "images/travel/IMG_3361.jpg", "caption": "If I locked my heart, would you find the key?" } ,
    { "src": "images/travel/IMG_3366.jpg", "caption": "Lisbon, Portugal. We did quite a bit of shopping here and had such a fun day!" },
    { "src": "images/travel/IMG_3370.jpg", "caption": "Took a long walk after lunch and could not believe how amazing these streets felt and looked!" } ,
    { "src": "images/travel/IMG_3376.jpg", "caption": "I'm glad I had on a very comfortable pair of nikes" }    ,
    { "src": "images/travel/IMG_3392.jpg", "caption": "The beauty of women - sculpted in stone at the Buddha Eden Garden." }    ,
    { "src": "images/travel/IMG_3408.jpg", "caption": "Giraffes at the Buddha Eden Garden." }   ,
    { "src": "images/travel/IMG_3419.jpg", "caption": "Buddha Eden Garden." }
  ]
}
